import io

import pytest

import abctk.transform_Keyaki.corpus_readers as cr

Mainichi95_sample = r"""
＼ＩＤ＼００００００３０
＼Ｃ０＼９５０１０１００３
＼ＡＤ＼０１
＼ＡＥ＼Ｎ
＼ＡＦ＼９５０１０１Ｍ０１
＼Ｔ１＼あああああああああああああああああああああああ
＼Ｓ１＼　　　　’９５．１．１　朝刊　１頁　写図無　（全１２２２２３文字）
＼Ｓ２＼　あああああああああああああああああああああああ、あああああああああああああああああ「ああああああああああああああああああああ。あああああ、ああああああああああ」ああああああ、ああああああああああああああああああああああああ。いいいいい、いいいいいいいい・いいいいいいいいいいいいいいい、いいいいいいいいいいいいいいいいいいいいいいいいいい。（２いいいいいいい）
＼Ｔ２＼　あああああああああああああああああああああああ、あああああああああああああああああ「ああああああああああああああああああああ。あああああ、ああああああああああ」ああああああ、ああああああああああああああああああああああああ。いいいいい、いいいいいいいい・いいいいいいいいいいいいいいい、いいいいいいいいいいいいいいいいいいいいいいいいいい。（２いいいいいいい）
＼ＫＡ＼嗚呼
＼ＡＡ＼アア
＼ＫＢ＼言い
＼ＫＢ＼イイ
＼ＩＤ＼００００００４０
＼Ｃ０＼９５０１０１００４
＼ＡＤ＼０１
＼ＡＥ＼Ｙ
＼ＡＦ＼９５０１０１Ｍ０１
＼Ｔ１＼あああああああ　ああああああああああああああ——ああああああ
＼Ｓ１＼　　　　’９５．１．１　朝刊　１頁　写図有　（全１２３１２３８文字）
＼Ｓ２＼　【ああああ３１日ああああ】ああああああああああああああああああああああああああああああああああああああ、ああああああああああああああああ、ああああああああああああああ。あああああああああああああああああああああああ。
＼Ｔ２＼　【ああああ３１日ああああ】ああああああああああああああああああああああああああああああああああああああ、ああああああああああああああああ、ああああああああああああああ。あああああああああああああああああああああああ。
＼Ｔ２＼　いいいいいいいいいいいいい、おおおおおおおおおお、いいいいいいいいい。おおおおおおおおおおおおおおおおおおおおおおおお。
＼Ｔ２＼　えええ、えええええええええええええええ、えええええ、ええええええええええええええ、ええええええええええええええええええええ。うう、ううううううううううう、ううううううううううううううううううううううううううう、ううううう。あああああああああああああああ、あああああ・ああああああああああああああ、あああああああああああああああ。
＼Ｔ２＼（ああああああああ「ああああああああああああ」あああああああ）
＼ＫＡ＼ああああ
＼ＩＤ＼００００００８０
＼Ｃ０＼９５０１０１００８
＼ＡＤ＼０２
＼ＡＥ＼Ｎ
＼ＡＦ＼９５０１０１Ｍ０２
＼Ｔ１＼ああああああああああ＜ああああ＞
＼Ｓ１＼　　　　’９５．１．１　朝刊　２頁　写図無　（全５４５４５４文字）
＼Ｓ２＼　ああああああああああああああああああ。
＼Ｔ２＼　ああああああああああああああああ。
＼Ｔ２＼　【ああ・あああ】いい、いいいい、いいいいいいいい、いいいいいいいい、いいいいいいいいいいいいいい。かかかかかかかかかかかかか・かかかかかかかかか（かかかか）かかかかかかかかかかか。きききき、きききききききききききききききききききききききききききき。くくくくくくくくくくくくくくくくくくくくくくくくくくく、くくくくくくくくくくくくくくくくく。
＼Ｔ２＼　【けけけ】けけけけけけけけけけけけけけ「けけけけけけけけけけけけ。けけけけけけけけけけけけけけけけけけけけけけけ」けけけけけけ。ここここここここここここここここここここここここ。ささささささささささささささささささささささ。
＼Ｔ２＼　（ししししし）しししししししししししししししししし。すすすすすすすすすすすすすすすすす、すすすすす。すすせせせせせせせせせせせ。（せそそそそそそそそそそ）そそそそそそそそそそそそそそそそそそそそそ。そそそたたたたたたたたたたたたたたたたたたたたたたたたたたたたたたたたたた。ち、ちちちちちちちちちちちちちちちちちちちちちちちち。つつつつつつつつつつつつつつつつつ。
＼Ｔ２＼　【てててて】とととととととととととととととととととと。とななななな、ななななななななななななななななななななななななななななななななななななな。にににににににににににににににににににににににに。にににぬぬぬ（ぬぬぬ）ぬぬぬぬぬぬぬぬぬぬぬぬぬぬぬぬ。
＼Ｔ２＼　【ねねねね】ねねねねねねねねねねねねねねねねねねねねねねねねねねねねね。ねねねねねねねねねねねねねねねねねね。ねねねねねねねねねねねねねねねねねねねねねねねねね。ねねねねねね。
＼Ｔ２＼　【のののの】（ののののののののののののののののの）ののののののののののののののののののののののののの、のののののののののののののの。ののの（ののののののの）の（ののののの）のののののののののののののののの。
＼ＫＡ＼ういういういうい
"""
@pytest.fixture(scope = "module")
def sample_Mainichi95():
    yield io.StringIO(Mainichi95_sample)

class Test_Mainichi95_Keyval:
    def test_from_line(self):
        assert (
            cr._Mainichi95_Keyval.from_line("＼ＡＦ＼９５０１０１Ｍ０１")
            == ("AF", "950101M01")
        )

        assert (
            cr._Mainichi95_Keyval.from_line("＼Ｔ２＼１９９２年。")
            == ("T2", "１９９２年。")
        )

def test_extract_sentences_from_Mainichi95(sample_Mainichi95):
    assert (
        len(tuple(cr.extract_sentences_from_Mainichi95(sample_Mainichi95)))
        == 34
    )
